# ElectricalFrequency Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..ElectricalFrequency Property
SpecTypeId Class See Also
---
Frequency, in discipline Electrical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId ElectricalFrequency { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElectricalFrequency As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ElectricalFrequency {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace